In [2]:
import pandas as pd

# Write a solution to find the name, population, and area of the big countries.

Input:
World table:
+-------------+-----------+---------+------------+--------------+
| name        | continent | area    | population | gdp          |
+-------------+-----------+---------+------------+--------------+
| Afghanistan | Asia      | 652230  | 25500100   | 20343000000  |
| Albania     | Europe    | 28748   | 2831741    | 12960000000  |
| Algeria     | Africa    | 2381741 | 37100000   | 188681000000 |
| Andorra     | Europe    | 468     | 78115      | 3712000000   |
| Angola      | Africa    | 1246700 | 20609294   | 100990000000 |
+-------------+-----------+---------+------------+--------------+
Output:
+-------------+------------+---------+
| name        | population | area    |
+-------------+------------+---------+
| Afghanistan | 25500100   | 652230  |
| Algeria     | 37100000   | 2381741 |
+-------------+------------+---------+

In [3]:
data = {'name': ['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola'],
        'continent': ['Asia', 'Europe', 'Africa', 'Europe', 'Africa'],
        'area': [652230, 28748, 2381741, 468, 1246700],
        'population': [25500100, 2831741, 37100000, 78115, 20609294],
        'gdp': [20343000000, 12960000000, 188681000000, 3712000000, 100990000000]}

df = pd.DataFrame(data)
df

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [8]:
filtered_df = df[(df['gdp'] > 3000000) & (df['population'] > 25000000)][['name', 'area', 'population']]
filtered_df

          name     area  population
0  Afghanistan   652230    25500100
2      Algeria  2381741    37100000

# Write a solution to find the ids of products that are both low fat and recyclable.

Input:
Products table:
+-------------+----------+------------+
| product_id  | low_fats | recyclable |
+-------------+----------+------------+
| 0           | Y        | N          |
| 1           | Y        | Y          |
| 2           | N        | Y          |
| 3           | Y        | Y          |
| 4           | N        | N          |
+-------------+----------+------------+
Output:
+-------------+
| product_id  |
+-------------+
| 1           |
| 3           |
+-------------+
Explanation: Only products 1 and 3 are both low fat and recyclable.

In [14]:
data = {
    "product_id": [0,1,2,3,4],
    "low_fats": ["Yes", "Yes", "No", "Yes", "No"],
    "recyclable": ["No", "Yes", "Yes", "Yes", "No"],
}

df = pd.DataFrame(data)
df

   product_id low_fats recyclable
0           0      Yes         No
1           1      Yes        Yes
2           2       No        Yes
3           3      Yes        Yes
4           4       No         No

In [16]:
result = df[(df['low_fats'] == 'Yes') & (df['recyclable'] == 'Yes')][['product_id']]
result

   product_id
1           1
3           3

# Write a solution to find all customers who never order anything.

Input:
Customers table:
+----+-------+
| id | name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+
Orders table:
+----+------------+
| id | customerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
Output:
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+

In [17]:
import pandas as pd

customers_data = {'id': [1, 2, 3, 4], 'name': ['Joe', 'Henry', 'Sam', 'Max']}
customers_df = pd.DataFrame(customers_data)

orders_data = {'id': [1, 2], 'customerId': [3, 1]}
orders_df = pd.DataFrame(orders_data)

In [19]:
# Combinar las tablas customers_data y orders_data
merged_df = pd.merge(customers_df, orders_df, left_on='id', right_on='customerId', how='left')

merged_df

   id_x   name  id_y  customerId
0     1    Joe   2.0         1.0
1     2  Henry   NaN         NaN
2     3    Sam   1.0         3.0
3     4    Max   NaN         NaN

In [29]:
# Filtrar los registros que no tienen coincidencias en la tabla orders_data
filtered_df = merged_df[merged_df['customerId'].isnull()][['name']]
filtered_df = filtered_df.rename(columns={'name': 'Customers'})
filtered_df

  Customers
1     Henry
3       Max

# Write a solution to find all the authors that viewed at least one of their own articles. Return the result table sorted by id in ascending order.

Input:
Views table:
+------------+-----------+-----------+------------+
| article_id | author_id | viewer_id | view_date  |
+------------+-----------+-----------+------------+
| 1          | 3         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |
+------------+-----------+-----------+------------+
Output:
+------+
| id   |
+------+
| 4    |
| 7    |
+------+

In [43]:
views_data = {
    "article_id": [1, 1, 2, 2, 4, 3, 3],
    "author_id": [3, 3, 7, 7, 7, 4, 4],
    "viewer_id": [5, 6, 7, 6, 1, 4, 4],
    "view_date": [
        "2019-08-01",
        "2019-08-02",
        "2019-08-01",
        "2019-08-02",
        "2019-07-22",
        "2019-07-21",
        "2019-07-21",
    ],
}

views_df = pd.DataFrame(views_data)
views_df

   article_id  author_id  viewer_id   view_date
0           1          3          5  2019-08-01
1           1          3          6  2019-08-02
2           2          7          7  2019-08-01
3           2          7          6  2019-08-02
4           4          7          1  2019-07-22
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21

In [44]:
result = views_df[views_df['viewer_id'] == views_df['author_id']][['author_id']]
result

   author_id
2          7
5          4
6          4

In [46]:
result = result.drop_duplicates()
result

   author_id
2          7
5          4

In [47]:
result = result.sort_values('author_id', ascending=True)
result

   author_id
5          4
2          7

# Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

Input:
Tweets table:
+----------+----------------------------------+
| tweet_id | content                          |
+----------+----------------------------------+
| 1        | Vote for Biden                   |
| 2        | Let us make America great again! |
+----------+----------------------------------+
Output:
+----------+
| tweet_id |
+----------+
| 2        |
+----------+
Explanation:
Tweet 1 has length = 14. It is a valid tweet.
Tweet 2 has length = 32. It is an invalid tweet.

In [48]:
import pandas as pd

data = {
    "tweet_id": [1, 2],
    "content": ["Vote for Biden", "Let us make America great again!"],
}

tweets_df = pd.DataFrame(data)
tweets_df

   tweet_id                           content
0         1                    Vote for Biden
1         2  Let us make America great again!

In [53]:
result = tweets_df[tweets_df['content'].str.len() > 15][['tweet_id']]
result

   tweet_id
1         2

# Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Input:
Employees table:
+-------------+---------+--------+
| employee_id | name    | salary |
+-------------+---------+--------+
| 2           | Meir    | 3000   |
| 3           | Michael | 3800   |
| 7           | Addilyn | 7400   |
| 8           | Juan    | 6100   |
| 9           | Kannon  | 7700   |
+-------------+---------+--------+
Output:
+-------------+-------+
| employee_id | bonus |
+-------------+-------+
| 2           | 0     |
| 3           | 0     |
| 7           | 7400  |
| 8           | 0     |
| 9           | 7700  |
+-------------+-------+

In [4]:
data = {'employee_id': [2, 3, 7, 8, 9],
        'name': ['Meir', 'Michael', 'Addilyn', 'Juan', 'Kannon'],
        'salary': [3000, 3800, 7400, 6100, 7700]}

employees_df = pd.DataFrame(data)
employees_df

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [6]:
employees_df['salary'] = employees_df.apply(lambda row: 0 if row['employee_id'] % 2 == 0 else row['salary'], axis=1)
employees_df

   employee_id     name  salary
0            2     Meir       0
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan       0
4            9   Kannon    7700

In [7]:
employees_df['salary'] = employees_df.apply(lambda row: 0 if row['name'][0] == 'M' else row['salary'], axis=1)
employees_df

   employee_id     name  salary
0            2     Meir       0
1            3  Michael       0
2            7  Addilyn    7400
3            8     Juan       0
4            9   Kannon    7700

In [8]:
result = employees_df.sort_values('employee_id', ascending=True)
result

   employee_id     name  salary
0            2     Meir       0
1            3  Michael       0
2            7  Addilyn    7400
3            8     Juan       0
4            9   Kannon    7700

In [9]:
result = result[['employee_id', 'salary']]
result

   employee_id  salary
0            2       0
1            3       0
2            7    7400
3            8       0
4            9    7700

# Write a solution to fix the names so that only the first character is uppercase and the rest are lowercase. Return the result table ordered by user_id.

Input:
Users table:
+---------+-------+
| user_id | name  |
+---------+-------+
| 1       | aLice |
| 2       | bOB   |
+---------+-------+
Output:
+---------+-------+
| user_id | name  |
+---------+-------+
| 1       | Alice |
| 2       | Bob   |
+---------+-------+

In [2]:
import pandas as pd

data = {'user_id': [1, 3, 2],
        'name': ['aLice', 'sspO', 'bOB']}

table = pd.DataFrame(data)
table

   user_id   name
0        1  aLice
1        3   sspO
2        2    bOB

In [7]:
table['name'] = [name.capitalize() for name in data['name']]
table

   user_id   name
0        1  Alice
1        3   Sspo
2        2    Bob

In [9]:
result = table.sort_values('user_id', ascending=True)
result

   user_id   name
0        1  Alice
2        2    Bob
1        3   Sspo

# Write a solution to find the users who have valid emails.

A valid e-mail has a prefix name and a domain where:

The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
The domain is '@leetcode.com'.
Return the result table in any order.

Input:
Users table:
+---------+-----------+-------------------------+
| user_id | name      | mail                    |
+---------+-----------+-------------------------+
| 1       | Winston   | winston@leetcode.com    |
| 2       | Jonathan  | jonathanisgreat         |
| 3       | Annabelle | bella-@leetcode.com     |
| 4       | Sally     | sally.come@leetcode.com |
| 5       | Marwan    | quarz#2020@leetcode.com |
| 6       | David     | david69@gmail.com       |
| 7       | Shapiro   | .shapo@leetcode.com     |
+---------+-----------+-------------------------+
Output:
+---------+-----------+-------------------------+
| user_id | name      | mail                    |
+---------+-----------+-------------------------+
| 1       | Winston   | winston@leetcode.com    |
| 3       | Annabelle | bella-@leetcode.com     |
| 4       | Sally     | sally.come@leetcode.com |
+---------+-----------+-------------------------+

In [27]:
import pandas as pd

# Users table
data = {
    "user_id": [1, 2, 3, 4, 5, 6, 7, 8],
    "name": ["Winston", "Jonathan", "Annabelle", "Sally", "Marwan", "David", "Shapiro", "Winston"],
    "mail": [
        "winston@leetcode.com",
        "jonathanisgreat",
        "bella-@leetcode.com",
        "sally.come@leetcode.com",
        "quarz#2020@leetcode.com",
        "david69@gmail.com",
        ".shapo@leetcode.com",
        "winston@leetcode?com",
    ],
}

# Create a DataFrame from the Users table
df = pd.DataFrame(data)

# Filter the DataFrame to find users with valid emails
valid_emails_df = df[df['mail'].str.match(r'^[A-Za-z][A-Za-z0-9_\.\-]*@leetcode(\?com)?\.com$')]

# Print the result table
print(valid_emails_df)

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com